<!-- dflook/terraform-github-actions {"workspace":"fix-github-output-2","backend":"f65b4be89d4a3eda6166ce43455337483be1a3f6dde8caa8db97c1d6332d1f08","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #77 at https://github.com/dflook/terraform-github-actions/actions/runs/3263967765","plan_hash":"8fac122427d3a6f1a03053d720864940c9cd0a1a80334c93aae805140dd0d0f8","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fix-github-output-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #77](https://github.com/dflook/terraform-github-actions/actions/runs/3263967765)